astb_relise/src/Documents/ПредварительныйПереходПраваСобственности/ПредварительныйПереходПраваСобственности.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПредварительныйПереходПраваСобственности</name>
  <registerRecords>AccumulationRegister.РеализованныеСИЗ</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СоздательДокумента</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НачалоПериода</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>КонецПериода</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ХарактеристикаНоменклатуры</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДокументВыдачи</name>
      <type>
        <types>DocumentRef.ВыдачаДежурныхСредствЗащиты</types>
        <types>DocumentRef.ВыдачаСредствЗащитыСотруднику</types>
      </type>
    </attributes>
    <attributes>
      <name>МВЗ</name>
      <type>
        <types>CatalogRef.МВЗ</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

astb_relise/src/AccumulationRegisters/СобственныеСИЗ/СобственныеСИЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>СобственныеСИЗ</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>МВЗ</name>
    <comment>Место возникновения затрат</comment>
    <type>
      <types>CatalogRef.МВЗ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ХарактеристикаНоменклатуры</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДокументВыдачи</name>
    <type>
      <types>DocumentRef.ВыдачаДежурныхСредствЗащиты</types>
      <types>DocumentRef.ЗаявкаНаВыдачу</types>
      <types>DocumentRef.ВыдачаСредствЗащитыСотруднику</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

astb_relise/src/InformationRegisters/МВЗСотрудников/МВЗСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>МВЗСотрудников</name>
  <resources>
    <name>МВЗ</name>
    <type>
      <types>CatalogRef.МВЗ</types>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

astb_relise/src/InformationRegisters/ОсновноеМестоРаботыСотрудника/ОсновноеМестоРаботыСотрудника.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОсновноеМестоРаботыСотрудника</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ОсновноеМестоРаботы</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </resources>
  <resources>
    <name>Должность</name>
    <type>
      <types>CatalogRef.ДолжностиИПрофессии</types>
    </type>
  </resources>
  <resources>
    <name>РабочееМесто</name>
    <type>
      <types>CatalogRef.РабочиеМестаАСТБ</types>
    </type>
  </resources>
  <resources>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

astb_relise/src/InformationRegisters/МВЗПодразделений/МВЗПодразделений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>МВЗПодразделений</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Использовать</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>МВЗ</name>
    <type>
      <types>CatalogRef.МВЗ</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

astb_relise/src/InformationRegisters/МВЗДолжностей/МВЗДолжностей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>МВЗДолжностей</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Использовать</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Должность</name>
    <type>
      <types>CatalogRef.ДолжностиИПрофессии</types>
    </type>
  </dimensions>
  <dimensions>
    <name>МВЗ</name>
    <type>
      <types>CatalogRef.МВЗ</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

astb_relise/src/AccumulationRegisters/ОстаткиНоменклатуры/ОстаткиНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОстаткиНоменклатуры</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ХарактеристикаНоменклатуры</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПроцентИзноса</name>
    <type>
      <types>CatalogRef.ПроцентыИзноса</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

astb_relise/src/Enums/ВидыВыдачиСИЗ/ВидыВыдачиСИЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыВыдачиСИЗ</name>
  <enumValues>
    <name>КоллективнаяВыдача</name>
  </enumValues>
  <enumValues>
    <name>ПерсональнаяВыдача</name>
  </enumValues>
  <enumValues>
    <name>ПроизвольнаяВыдача</name>
  </enumValues>
  <enumValues>
    <name>УпрощеннаяВыдача</name>
  </enumValues>
</mdclass:Enum>

astb_relise/src/Enums/ВидыОперацийВыдачиСИЗ/ВидыОперацийВыдачиСИЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОперацийВыдачиСИЗ</name>
  <enumValues>
    <name>ПредварительнаяЗаявка</name>
  </enumValues>
  <enumValues>
    <name>ФактическаяВыдача</name>
  </enumValues>
</mdclass:Enum>

astb_relise/src/Documents/ВыдачаДежурныхСредствЗащиты/ВыдачаДежурныхСредствЗащиты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВыдачаДежурныхСредствЗащиты</name>
  <registerRecords>InformationRegister.КодыМаркировкиВыданныхСредствЗащиты</registerRecords>
  <registerRecords>AccumulationRegister.ВыданныеСредстваЗащиты</registerRecords>
  <registerRecords>AccumulationRegister.ОстаткиНоменклатуры</registerRecords>
  <registerRecords>InformationRegister.ИсторияОбращенийНаСклад</registerRecords>
  <registerRecords>InformationRegister.ШтрихкодыНоменклатурыДляУчетаЧистки</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СоздательДокумента</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МОЛ</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредварительнаяСборка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>НормаВыдачи</name>
      <type>
        <types>CatalogRef.НормыВыдачиСИЗ</types>
      </type>
    </attributes>
    <attributes>
      <name>НоменклатураНормы</name>
      <type>
        <types>CatalogRef.НоменклатураНормОрганизации</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ХарактеристикаНоменклатуры</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентИзноса</name>
      <type>
        <types>CatalogRef.ПроцентыИзноса</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВыдачаСверхНорм</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ШтрихкодыНоменклатуры</name>
    <attributes>
      <name>Штрихкод</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ХарактеристикаНоменклатуры</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаВыдачи</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КодыМаркировки</name>
    <attributes>
      <name>КодМаркировки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ХарактеристикаНоменклатуры</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

astb_relise/src/Documents/ПредварительныйПереходПраваСобственности/ManagerModule.bsl
//АСТБ_Горюшин_Алексей_17125

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

// Заполняет список команд печати.
//
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	// процедура добавлена для совместимости
	
КонецПроцедуры

Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПредварительныйПереходПраваСобственностиТовары.Номенклатура КАК Номенклатура,
	|	ПредварительныйПереходПраваСобственностиТовары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ПредварительныйПереходПраваСобственностиТовары.Количество КАК Количество,
	|	ПредварительныйПереходПраваСобственностиТовары.МВЗ КАК МВЗ,
	|	ПредварительныйПереходПраваСобственностиТовары.Ссылка.Организация КАК Организация,
	|	ПредварительныйПереходПраваСобственностиТовары.Сумма КАК Сумма,
	|	ПредварительныйПереходПраваСобственностиТовары.ДокументВыдачи КАК ДокументВыдачи,
	|	ПредварительныйПереходПраваСобственностиТовары.ДокументВыдачи.Дата КАК Период,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ПредварительныйПереходПраваСобственностиТовары.ДокументВыдачи) = ТИП(Документ.ВыдачаДежурныхСредствЗащиты)
	|			ТОГДА ""Дежурная""
	|		ИНАЧЕ ПредварительныйПереходПраваСобственностиТовары.ДокументВыдачи.ВидВыдачиСИЗ
	|	КОНЕЦ КАК ВидВыдачиСИЗ,
	|	ПредварительныйПереходПраваСобственностиТовары.ДокументВыдачи.Склад КАК СкладВыдачи,
	|	ВЫБОР
	|		КОГДА ПредварительныйПереходПраваСобственностиТовары.ДокументВыдачи ССЫЛКА Документ.ВыдачаСредствЗащитыСотруднику
	|				И ПредварительныйПереходПраваСобственностиТовары.ДокументВыдачи.ВидВыдачиСИЗ = ЗНАЧЕНИЕ(Перечисление.ВидыВыдачиСИЗ.КоллективнаяВыдача)
	|			ТОГДА ПредварительныйПереходПраваСобственностиТовары.ДокументВыдачи.СкладОтправитель
	|		ИНАЧЕ ПредварительныйПереходПраваСобственностиТовары.ДокументВыдачи.Склад
	|	КОНЕЦ КАК СкладОтправитель,
	|	ПредварительныйПереходПраваСобственностиТовары.Номенклатура.Поставщик КАК Поставщик,
	|	ПредварительныйПереходПраваСобственностиТовары.Ссылка КАК ПредварительныйПереходПраваСобственности
	|ИЗ
	|	Документ.ПредварительныйПереходПраваСобственности.Товары КАК ПредварительныйПереходПраваСобственностиТовары
	|ГДЕ
	|	ПредварительныйПереходПраваСобственностиТовары.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ТаблицыДляДвижений = ДополнительныеСвойства.ТаблицыДляДвижений;
	ТаблицыДляДвижений.Вставить("ТаблицаРеализованныеСИЗ", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры

Процедура ЗаполнитьПоДокументамВыдачиНаСервере(ТекущийОбъект) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СобственныеСИЗОбороты.МВЗ КАК МВЗ,
	|	СобственныеСИЗОбороты.Номенклатура КАК Номенклатура,
	|	СобственныеСИЗОбороты.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	СобственныеСИЗОбороты.ДокументВыдачи КАК ДокументВыдачи,
	|	СУММА(СобственныеСИЗОбороты.КоличествоОборот) КАК КоличествоОборот
	|ПОМЕСТИТЬ ВТ_СобственныеСИЗ
	|ИЗ
	|	РегистрНакопления.СобственныеСИЗ.Обороты(&ДатаНачала, &ДатаОкончания, Регистратор, Организация = &Организация) КАК СобственныеСИЗОбороты
	|
	|СГРУППИРОВАТЬ ПО
	|	СобственныеСИЗОбороты.МВЗ,
	|	СобственныеСИЗОбороты.Номенклатура,
	|	СобственныеСИЗОбороты.ХарактеристикаНоменклатуры,
	|	СобственныеСИЗОбороты.ДокументВыдачи
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МВЗСотрудников.Сотрудник КАК Сотрудник,
	|	МВЗСотрудников.МВЗ КАК МВЗ
	|ПОМЕСТИТЬ ВТ_МВЗСотрудников
	|ИЗ
	|	РегистрСведений.МВЗСотрудников КАК МВЗСотрудников
	|ГДЕ
	|	МВЗСотрудников.Организация = &Организация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОсновноеМестоРаботыСотрудника.Период КАК Период,
	|	ОсновноеМестоРаботыСотрудника.Сотрудник КАК Сотрудник,
	|	ОсновноеМестоРаботыСотрудника.Подразделение КАК Подразделение,
	|	ОсновноеМестоРаботыСотрудника.МоментВремени КАК МоментВремени,
	|	ОсновноеМестоРаботыСотрудника.ОсновноеМестоРаботы КАК ОсновноеМестоРаботы,
	|	ОсновноеМестоРаботыСотрудника.Должность КАК Должность
	|ПОМЕСТИТЬ ВТ_ОсновныеМестаРаботыСотрудников
	|ИЗ
	|	РегистрСведений.ОсновноеМестоРаботыСотрудника КАК ОсновноеМестоРаботыСотрудника
	|ГДЕ
	|	ОсновноеМестоРаботыСотрудника.Активность
	|	И ОсновноеМестоРаботыСотрудника.Организация = &Организация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.Сотрудник КАК Сотрудник,
	|	ВложенныйЗапрос.Подразделение КАК Подразделение,
	|	ВложенныйЗапрос.Должность КАК Должность,
	|	ВложенныйЗапрос.Период КАК НачалоПериода,
	|	МИНИМУМ(ЕСТЬNULL(ВТ_ОсновныеМестаРаботыСотрудников.Период, &Период)) КАК КонецПериода,
	|	ЕСТЬNULL(ВТ_МВЗСотрудников.МВЗ, ЗНАЧЕНИЕ(Справочник.МВЗ.ПустаяСсылка)) КАК МВЗ
	|ПОМЕСТИТЬ ВТ_ПериодыРаботыСотрудников
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВТ_ОсновныеМестаРаботыСотрудников.Период КАК Период,
	|		ВТ_ОсновныеМестаРаботыСотрудников.Сотрудник КАК Сотрудник,
	|		ВТ_ОсновныеМестаРаботыСотрудников.Подразделение КАК Подразделение,
	|		ВТ_ОсновныеМестаРаботыСотрудников.МоментВремени КАК МоментВремени,
	|		ВТ_ОсновныеМестаРаботыСотрудников.Должность КАК Должность
	|	ИЗ
	|		ВТ_ОсновныеМестаРаботыСотрудников КАК ВТ_ОсновныеМестаРаботыСотрудников
	|	ГДЕ
	|		ВТ_ОсновныеМестаРаботыСотрудников.ОсновноеМестоРаботы) КАК ВложенныйЗапрос
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОсновныеМестаРаботыСотрудников КАК ВТ_ОсновныеМестаРаботыСотрудников
	|		ПО ВложенныйЗапрос.Сотрудник = ВТ_ОсновныеМестаРаботыСотрудников.Сотрудник
	|			И ВложенныйЗапрос.МоментВремени < ВТ_ОсновныеМестаРаботыСотрудников.МоментВремени
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_МВЗСотрудников КАК ВТ_МВЗСотрудников
	|		ПО ВложенныйЗапрос.Сотрудник = ВТ_МВЗСотрудников.Сотрудник
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.Сотрудник,
	|	ВложенныйЗапрос.Подразделение,
	|	ВложенныйЗапрос.Период,
	|	ЕСТЬNULL(ВТ_МВЗСотрудников.МВЗ, ЗНАЧЕНИЕ(Справочник.МВЗ.ПустаяСсылка)),
	|	ВложенныйЗапрос.Должность
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МВЗПодразделений.Период КАК Период,
	|	МВЗПодразделений.Подразделение КАК Подразделение,
	|	МВЗПодразделений.МВЗ КАК МВЗ,
	|	МВЗПодразделений.Использовать КАК Использовать,
	|	МВЗПодразделений.МоментВремени КАК МоментВремени
	|ПОМЕСТИТЬ ВТ_МВЗПодразделений
	|ИЗ
	|	РегистрСведений.МВЗПодразделений КАК МВЗПодразделений
	|ГДЕ
	|	МВЗПодразделений.Подразделение.Владелец = &Организация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.Подразделение КАК Подразделение,
	|	ВложенныйЗапрос.МВЗ КАК МВЗ,
	|	ВложенныйЗапрос.Период КАК НачалоПериода,
	|	МИНИМУМ(ЕСТЬNULL(ВТ_МВЗПодразделений.Период, &Период)) КАК КонецПериода,
	|	ВложенныйЗапрос.МоментВремени КАК МоментВремени
	|ПОМЕСТИТЬ ВТ_ПериодыМВЗ
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВТ_МВЗПодразделений.Период КАК Период,
	|		ВТ_МВЗПодразделений.Подразделение КАК Подразделение,
	|		ВТ_МВЗПодразделений.МВЗ КАК МВЗ,
	|		ВТ_МВЗПодразделений.МоментВремени КАК МоментВремени
	|	ИЗ
	|		ВТ_МВЗПодразделений КАК ВТ_МВЗПодразделений
	|	ГДЕ
	|		ВТ_МВЗПодразделений.Использовать) КАК ВложенныйЗапрос
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_МВЗПодразделений КАК ВТ_МВЗПодразделений
	|		ПО ВложенныйЗапрос.Подразделение = ВТ_МВЗПодразделений.Подразделение
	|			И ВложенныйЗапрос.МоментВремени < ВТ_МВЗПодразделений.МоментВремени
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.Период,
	|	ВложенныйЗапрос.Подразделение,
	|	ВложенныйЗапрос.МВЗ,
	|	ВложенныйЗапрос.МоментВремени
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МВЗДолжностей.Период КАК Период,
	|	МВЗДолжностей.Должность КАК Должность,
	|	МВЗДолжностей.МВЗ КАК МВЗ,
	|	МВЗДолжностей.Использовать КАК Использовать,
	|	МВЗДолжностей.МоментВремени КАК МоментВремени
	|ПОМЕСТИТЬ ВТ_МВЗДолжностей
	|ИЗ
	|	РегистрСведений.МВЗДолжностей КАК МВЗДолжностей
	|ГДЕ
	|	МВЗДолжностей.Организация = &Организация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.Должность КАК Должность,
	|	ВложенныйЗапрос.МВЗ КАК МВЗ,
	|	ВложенныйЗапрос.Период КАК НачалоПериода,
	|	МИНИМУМ(ЕСТЬNULL(ВТ_МВЗДолжностей.Период, &Период)) КАК КонецПериода,
	|	ВложенныйЗапрос.МоментВремени КАК МоментВремени
	|ПОМЕСТИТЬ ВТ_ПериодыМВЗДолжностей
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВТ_МВЗДолжностей.Период КАК Период,
	|		ВТ_МВЗДолжностей.Должность КАК Должность,
	|		ВТ_МВЗДолжностей.МВЗ КАК МВЗ,
	|		ВТ_МВЗДолжностей.МоментВремени КАК МоментВремени
	|	ИЗ
	|		ВТ_МВЗДолжностей КАК ВТ_МВЗДолжностей
	|	ГДЕ
	|		ВТ_МВЗДолжностей.Использовать) КАК ВложенныйЗапрос
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_МВЗДолжностей КАК ВТ_МВЗДолжностей
	|		ПО ВложенныйЗапрос.Должность = ВТ_МВЗДолжностей.Должность
	|			И ВложенныйЗапрос.МоментВремени < ВТ_МВЗДолжностей.МоментВремени
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.Период,
	|	ВложенныйЗапрос.Должность,
	|	ВложенныйЗапрос.МВЗ,
	|	ВложенныйЗапрос.МоментВремени
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВыдачаСредствЗащитыСотрудникуТовары.Комплект КАК Комплект,
	|	ВыдачаСредствЗащитыСотрудникуТовары.Номенклатура КАК Номенклатура,
	|	ВыдачаСредствЗащитыСотрудникуТовары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	СУММА(ВЫБОР
	|			КОГДА ВыдачаСредствЗащитыСотрудникуТовары.КоличествоВКомплекте = 0
	|				ТОГДА ВыдачаСредствЗащитыСотрудникуТовары.Количество
	|			ИНАЧЕ ВыдачаСредствЗащитыСотрудникуТовары.Количество * ВыдачаСредствЗащитыСотрудникуТовары.КоличествоВКомплекте
	|		КОНЕЦ) КАК КоличествоСумма,
	|	ВыдачаСредствЗащитыСотрудникуТовары.Цена КАК Цена,
	|	СУММА(ВыдачаСредствЗащитыСотрудникуТовары.Сумма) КАК СуммаСумма,
	|	ВыдачаСредствЗащитыСотрудникуТовары.Ссылка КАК Ссылка,
	|	ВыдачаСредствЗащитыСотрудникуТовары.Ссылка.МВЗ КАК МВЗ,
	|	ВыдачаСредствЗащитыСотрудникуТовары.Сотрудник КАК Сотрудник,
	//АсТБ_Alexey_103067_********************************************************************
	|	ВыдачаСредствЗащитыСотрудникуТовары.НомерСтрокиКомплекта КАК НомерСтрокиКомплекта
	//АсТБ_Alexey_103067_********************************************************************
	|ПОМЕСТИТЬ ВТ_ДокументыВыдачиПредварательная
	|ИЗ
	|	Документ.ВыдачаСредствЗащитыСотруднику.Товары КАК ВыдачаСредствЗащитыСотрудникуТовары
	|ГДЕ
	|	ВыдачаСредствЗащитыСотрудникуТовары.Ссылка.Организация = &Организация
	|	И ВыдачаСредствЗащитыСотрудникуТовары.Ссылка.Проведен
	|	И ВыдачаСредствЗащитыСотрудникуТовары.Ссылка.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
	|	И НЕ ВыдачаСредствЗащитыСотрудникуТовары.НеВыдано
	|	И ВЫБОР
	|			КОГДА ВыдачаСредствЗащитыСотрудникуТовары.Ссылка.ВидВыдачиСИЗ = ЗНАЧЕНИЕ(Перечисление.ВидыВыдачиСИЗ.КоллективнаяВыдача)
	|				ТОГДА ВыдачаСредствЗащитыСотрудникуТовары.Ссылка.ВидОперации = &ВидОперацииВыдачиСИЗ
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И НЕ ВыдачаСредствЗащитыСотрудникуТовары.Ссылка.ПредварительнаяСборка
	|	И (ВыдачаСредствЗащитыСотрудникуТовары.ПроцентИзноса.Код = 0
	|			ИЛИ ВыдачаСредствЗащитыСотрудникуТовары.ПроцентИзноса = ЗНАЧЕНИЕ(Справочник.ПроцентыИзноса.ПустаяСсылка))
	|
	|СГРУППИРОВАТЬ ПО
	|	ВыдачаСредствЗащитыСотрудникуТовары.Цена,
	|	ВыдачаСредствЗащитыСотрудникуТовары.Ссылка,
	|	ВыдачаСредствЗащитыСотрудникуТовары.Ссылка.МВЗ,
	|	ВыдачаСредствЗащитыСотрудникуТовары.Сотрудник,
	|	ВыдачаСредствЗащитыСотрудникуТовары.Комплект,
	|	ВыдачаСредствЗащитыСотрудникуТовары.Номенклатура,
	|	ВыдачаСредствЗащитыСотрудникуТовары.ХарактеристикаНоменклатуры,
	//АсТБ_Alexey_103067_********************************************************************
	|	ВыдачаСредствЗащитыСотрудникуТовары.НомерСтрокиКомплекта
	//АсТБ_Alexey_103067_********************************************************************
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка),
	|	ВыдачаДежурныхСредствЗащитыТовары.Номенклатура,
	|	ВыдачаДежурныхСредствЗащитыТовары.ХарактеристикаНоменклатуры,
	|	СУММА(ВыдачаДежурныхСредствЗащитыТовары.Количество),
	|	ВыдачаДежурныхСредствЗащитыТовары.Цена,
	|	СУММА(ВыдачаДежурныхСредствЗащитыТовары.Сумма),
	|	ВыдачаДежурныхСредствЗащитыТовары.Ссылка,
	|	МАКСИМУМ(ЗНАЧЕНИЕ(Справочник.МВЗ.ПустаяСсылка)),
	|	ВыдачаДежурныхСредствЗащитыТовары.Ссылка.Сотрудник,
	//АсТБ_Alexey_103067_********************************************************************
	|	0
	//АсТБ_Alexey_103067_********************************************************************
	|ИЗ
	|	Документ.ВыдачаДежурныхСредствЗащиты.Товары КАК ВыдачаДежурныхСредствЗащитыТовары
	|ГДЕ
	|	ВыдачаДежурныхСредствЗащитыТовары.Ссылка.Организация = &Организация
	|	И ВыдачаДежурныхСредствЗащитыТовары.Ссылка.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
	|	И ВыдачаДежурныхСредствЗащитыТовары.Ссылка.Проведен
	|	И НЕ ВыдачаДежурныхСредствЗащитыТовары.Ссылка.ПредварительнаяСборка
	|	И (ВыдачаДежурныхСредствЗащитыТовары.ПроцентИзноса.Код = 0
	|			ИЛИ ВыдачаДежурныхСредствЗащитыТовары.ПроцентИзноса = ЗНАЧЕНИЕ(Справочник.ПроцентыИзноса.ПустаяСсылка))
	|
	|СГРУППИРОВАТЬ ПО
	|	ВыдачаДежурныхСредствЗащитыТовары.Номенклатура,
	|	ВыдачаДежурныхСредствЗащитыТовары.ХарактеристикаНоменклатуры,
	|	ВыдачаДежурныхСредствЗащитыТовары.Цена,
	|	ВыдачаДежурныхСредствЗащитыТовары.Ссылка,
	|	ВыдачаДежурныхСредствЗащитыТовары.Ссылка.Сотрудник
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВыдачаСредствЗащитыСотрудникуТовары.Комплект,
	|	ВыдачаСредствЗащитыСотрудникуТовары.Номенклатура,
	|	ВыдачаСредствЗащитыСотрудникуТовары.ХарактеристикаНоменклатуры,
	|	СУММА(ВЫБОР
	|			КОГДА ВыдачаСредствЗащитыСотрудникуТовары.КоличествоВКомплекте = 0
	|				ТОГДА ВыдачаСредствЗащитыСотрудникуТовары.Количество
	|			ИНАЧЕ ВыдачаСредствЗащитыСотрудникуТовары.Количество * ВыдачаСредствЗащитыСотрудникуТовары.КоличествоВКомплекте
	|		КОНЕЦ),
	|	ВыдачаСредствЗащитыСотрудникуТовары.Цена,
	|	СУММА(ВыдачаСредствЗащитыСотрудникуТовары.Сумма),
	|	ВыдачаСредствЗащитыСотрудникуТовары.Ссылка,
	|	ВыдачаСредствЗащитыСотрудникуТовары.Ссылка.МВЗ,
	|	ВыдачаСредствЗащитыСотрудникуТовары.Сотрудник,
	//АсТБ_Alexey_103067_********************************************************************
	|	ВыдачаСредствЗащитыСотрудникуТовары.НомерСтрокиКомплекта
	//АсТБ_Alexey_103067_********************************************************************
	|ИЗ
	|	Документ.ВыдачаСредствЗащитыСотруднику.Товары КАК ВыдачаСредствЗащитыСотрудникуТовары
	|ГДЕ
	|	ВыдачаСредствЗащитыСотрудникуТовары.Ссылка.Организация = &Организация
	|	И ВыдачаСредствЗащитыСотрудникуТовары.Ссылка.Проведен
	|	И ВыдачаСредствЗащитыСотрудникуТовары.Ссылка.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
	|	И НЕ ВыдачаСредствЗащитыСотрудникуТовары.НеВыдано
	|	И ВыдачаСредствЗащитыСотрудникуТовары.Ссылка.Склад.АвтоматизированнаяВыдача = ИСТИНА
	|	И НЕ &ВидОперацииВыдачиСИЗ = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийВыдачиСИЗ.ФактическаяВыдача)
	|	И НЕ ВыдачаСредствЗащитыСотрудникуТовары.Ссылка.ПредварительнаяСборка
	|	И (ВыдачаСредствЗащитыСотрудникуТовары.ПроцентИзноса.Код = 0
	|			ИЛИ ВыдачаСредствЗащитыСотрудникуТовары.ПроцентИзноса = ЗНАЧЕНИЕ(Справочник.ПроцентыИзноса.ПустаяСсылка))
	|
	|СГРУППИРОВАТЬ ПО
	|	ВыдачаСредствЗащитыСотрудникуТовары.Цена,
	|	ВыдачаСредствЗащитыСотрудникуТовары.Ссылка,
	|	ВыдачаСредствЗащитыСотрудникуТовары.Ссылка.МВЗ,
	|	ВыдачаСредствЗащитыСотрудникуТовары.Сотрудник,
	|	ВыдачаСредствЗащитыСотрудникуТовары.Комплект,
	|	ВыдачаСредствЗащитыСотрудникуТовары.Номенклатура,
	|	ВыдачаСредствЗащитыСотрудникуТовары.ХарактеристикаНоменклатуры,
	//АсТБ_Alexey_103067_********************************************************************
	|	ВыдачаСредствЗащитыСотрудникуТовары.НомерСтрокиКомплекта
	//АсТБ_Alexey_103067_********************************************************************
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ДокументыВыдачиПредварательная.Комплект КАК Комплект,
	|	ВТ_ДокументыВыдачиПредварательная.Номенклатура КАК Номенклатура,
	|	ВТ_ДокументыВыдачиПредварательная.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ВТ_ДокументыВыдачиПредварательная.Цена КАК Цена,
	|	ВТ_ДокументыВыдачиПредварательная.Ссылка КАК Ссылка,
	|	ВТ_ДокументыВыдачиПредварательная.Сотрудник КАК Сотрудник,
	|	ВТ_ДокументыВыдачиПредварательная.МВЗ КАК МВЗ,
	|	ВТ_ДокументыВыдачиПредварательная.КоличествоСумма КАК Количество,
	|	ВТ_ДокументыВыдачиПредварательная.СуммаСумма КАК Сумма,
	//АсТБ_Alexey_103067_********************************************************************
	|	ВТ_ДокументыВыдачиПредварательная.НомерСтрокиКомплекта КАК НомерСтрокиКомплекта
	//АсТБ_Alexey_103067_********************************************************************
	|ПОМЕСТИТЬ ВТ_ДокументыВыдачи
	|ИЗ
	|	ВТ_ДокументыВыдачиПредварательная КАК ВТ_ДокументыВыдачиПредварательная
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ДокументыВыдачи.Комплект КАК Комплект,
	|	ВТ_ДокументыВыдачи.Номенклатура КАК Номенклатура,
	|	ВТ_ДокументыВыдачи.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	СУММА(ВТ_ДокументыВыдачи.Количество) КАК Количество,
	|	ВТ_ДокументыВыдачи.Цена КАК Цена,
	|	СУММА(ВТ_ДокументыВыдачи.Сумма) КАК Сумма,
	|	ВТ_ДокументыВыдачи.Ссылка КАК ДокументВыдачи,
	|	ВТ_ПериодыРаботыСотрудников.Подразделение КАК Подразделение,
	|	ВТ_ПериодыРаботыСотрудников.Должность КАК Должность,
	|	ВЫБОР
	|		КОГДА ВТ_ДокументыВыдачи.МВЗ = ЗНАЧЕНИЕ(Справочник.МВЗ.ПустаяСсылка)
	|			ТОГДА ВТ_ПериодыРаботыСотрудников.МВЗ
	|		ИНАЧЕ ВТ_ДокументыВыдачи.МВЗ
	|	КОНЕЦ КАК МВЗ,
	//АсТБ_Alexey_103067_********************************************************************
	|	ВТ_ДокументыВыдачи.НомерСтрокиКомплекта КАК НомерСтрокиКомплекта
	//АсТБ_Alexey_103067_********************************************************************
	|ПОМЕСТИТЬ ВТ_ВыдачаСПодразделениями
	|ИЗ
	|	ВТ_ДокументыВыдачи КАК ВТ_ДокументыВыдачи
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПериодыРаботыСотрудников КАК ВТ_ПериодыРаботыСотрудников
	|		ПО ВТ_ДокументыВыдачи.Сотрудник = ВТ_ПериодыРаботыСотрудников.Сотрудник
	|			И ВТ_ДокументыВыдачи.Ссылка.Дата <= ВТ_ПериодыРаботыСотрудников.КонецПериода
	|			И ВТ_ДокументыВыдачи.Ссылка.Дата > ВТ_ПериодыРаботыСотрудников.НачалоПериода
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ДокументыВыдачи.Комплект,
	|	ВТ_ДокументыВыдачи.Номенклатура,
	|	ВТ_ДокументыВыдачи.ХарактеристикаНоменклатуры,
	|	ВТ_ДокументыВыдачи.Цена,
	|	ВТ_ДокументыВыдачи.Ссылка,
	|	ВТ_ПериодыРаботыСотрудников.Подразделение,
	|	ВЫБОР
	|		КОГДА ВТ_ДокументыВыдачи.МВЗ = ЗНАЧЕНИЕ(Справочник.МВЗ.ПустаяСсылка)
	|			ТОГДА ВТ_ПериодыРаботыСотрудников.МВЗ
	|		ИНАЧЕ ВТ_ДокументыВыдачи.МВЗ
	|	КОНЕЦ,
	|	ВТ_ПериодыРаботыСотрудников.Должность,
	//АсТБ_Alexey_103067_********************************************************************
	|	ВТ_ДокументыВыдачи.НомерСтрокиКомплекта
	//АсТБ_Alexey_103067_********************************************************************
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ВыдачаСПодразделениями.Комплект КАК Комплект,
	|	ВТ_ВыдачаСПодразделениями.Номенклатура КАК Номенклатура,
	|	ВТ_ВыдачаСПодразделениями.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	СУММА(ВТ_ВыдачаСПодразделениями.Количество) КАК Количество,
	|	ВТ_ВыдачаСПодразделениями.Цена КАК Цена,
	|	СУММА(ВТ_ВыдачаСПодразделениями.Сумма) КАК Сумма,
	|	ВЫБОР
	|		КОГДА ВТ_ВыдачаСПодразделениями.МВЗ = ЗНАЧЕНИЕ(Справочник.МВЗ.ПустаяСсылка)
	|			ТОГДА ВЫБОР
	|					КОГДА ВТ_ПериодыМВЗ.МВЗ ЕСТЬ NULL
	|						ТОГДА ВЫБОР
	|								КОГДА ВТ_ПериодыМВЗДолжностей.МВЗ ЕСТЬ NULL
	|									ТОГДА ЗНАЧЕНИЕ(Справочник.МВЗ.ПустаяСсылка)
	|								ИНАЧЕ ВТ_ПериодыМВЗДолжностей.МВЗ
	|							КОНЕЦ
	|					ИНАЧЕ ВТ_ПериодыМВЗ.МВЗ
	|				КОНЕЦ
	|		ИНАЧЕ ВТ_ВыдачаСПодразделениями.МВЗ
	|	КОНЕЦ КАК МВЗ,
	|	ВТ_ВыдачаСПодразделениями.ДокументВыдачи КАК ДокументВыдачи,
	//АсТБ_Alexey_103067_********************************************************************
	|	ВТ_ВыдачаСПодразделениями.НомерСтрокиКомплекта КАК НомерСтрокиКомплекта
	//АсТБ_Alexey_103067_********************************************************************
	|ПОМЕСТИТЬ ВТ_ВыдачаСМВЗ
	|ИЗ
	|	ВТ_ВыдачаСПодразделениями КАК ВТ_ВыдачаСПодразделениями
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПериодыМВЗ КАК ВТ_ПериодыМВЗ
	|		ПО ВТ_ВыдачаСПодразделениями.Подразделение = ВТ_ПериодыМВЗ.Подразделение
	|			И ВТ_ВыдачаСПодразделениями.ДокументВыдачи.Дата <= ВТ_ПериодыМВЗ.КонецПериода
	|			И ВТ_ВыдачаСПодразделениями.ДокументВыдачи.Дата > ВТ_ПериодыМВЗ.НачалоПериода
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПериодыМВЗДолжностей КАК ВТ_ПериодыМВЗДолжностей
	|		ПО ВТ_ВыдачаСПодразделениями.Должность = ВТ_ПериодыМВЗДолжностей.Должность
	|			И ВТ_ВыдачаСПодразделениями.ДокументВыдачи.Дата <= ВТ_ПериодыМВЗДолжностей.КонецПериода
	|			И ВТ_ВыдачаСПодразделениями.ДокументВыдачи.Дата > ВТ_ПериодыМВЗДолжностей.НачалоПериода
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ВыдачаСПодразделениями.Комплект,
	|	ВТ_ВыдачаСПодразделениями.Номенклатура,
	|	ВТ_ВыдачаСПодразделениями.ХарактеристикаНоменклатуры,
	|	ВТ_ВыдачаСПодразделениями.Цена,
	|	ВТ_ВыдачаСПодразделениями.ДокументВыдачи,
	|	ВЫБОР
	|		КОГДА ВТ_ВыдачаСПодразделениями.МВЗ = ЗНАЧЕНИЕ(Справочник.МВЗ.ПустаяСсылка)
	|			ТОГДА ВЫБОР
	|					КОГДА ВТ_ПериодыМВЗ.МВЗ ЕСТЬ NULL
	|						ТОГДА ВЫБОР
	|								КОГДА ВТ_ПериодыМВЗДолжностей.МВЗ ЕСТЬ NULL
	|									ТОГДА ЗНАЧЕНИЕ(Справочник.МВЗ.ПустаяСсылка)
	|								ИНАЧЕ ВТ_ПериодыМВЗДолжностей.МВЗ
	|							КОНЕЦ
	|					ИНАЧЕ ВТ_ПериодыМВЗ.МВЗ
	|				КОНЕЦ
	|		ИНАЧЕ ВТ_ВыдачаСПодразделениями.МВЗ
	|	КОНЕЦ,
	//АсТБ_Alexey_103067_********************************************************************
	|	ВТ_ВыдачаСПодразделениями.НомерСтрокиКомплекта
	//АсТБ_Alexey_103067_********************************************************************
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ВыдачаСМВЗ.Комплект КАК Комплект,
	|	ВТ_ВыдачаСМВЗ.Номенклатура КАК Номенклатура,
	|	ВТ_ВыдачаСМВЗ.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	СУММА(ВТ_ВыдачаСМВЗ.Количество - ЕСТЬNULL(ВТ_СобственныеСИЗ.КоличествоОборот, 0)) КАК Количество,
	|	ВТ_ВыдачаСМВЗ.Цена КАК Цена,
	|	СУММА(ВТ_ВыдачаСМВЗ.Цена * (ВТ_ВыдачаСМВЗ.Количество - ЕСТЬNULL(ВТ_СобственныеСИЗ.КоличествоОборот, 0))) КАК Сумма,
	|	ВТ_ВыдачаСМВЗ.ДокументВыдачи КАК ДокументВыдачи,
	|	ЕСТЬNULL(ВТ_ВыдачаСМВЗ.МВЗ, ЗНАЧЕНИЕ(Справочник.МВЗ.ПустаяСсылка)) КАК МВЗ,
	//АсТБ_Alexey_103067_********************************************************************
	|	ВТ_ВыдачаСМВЗ.НомерСтрокиКомплекта КАК НомерСтрокиКомплекта
	//АсТБ_Alexey_103067_********************************************************************
	|ПОМЕСТИТЬ ВТ_РезультатДоСравнения
	|ИЗ
	|	ВТ_ВыдачаСМВЗ КАК ВТ_ВыдачаСМВЗ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СобственныеСИЗ КАК ВТ_СобственныеСИЗ
	|		ПО ВТ_ВыдачаСМВЗ.Номенклатура = ВТ_СобственныеСИЗ.Номенклатура
	|			И ВТ_ВыдачаСМВЗ.ХарактеристикаНоменклатуры = ВТ_СобственныеСИЗ.ХарактеристикаНоменклатуры
	|			И ВТ_ВыдачаСМВЗ.ДокументВыдачи = ВТ_СобственныеСИЗ.ДокументВыдачи
	|			И ВТ_ВыдачаСМВЗ.МВЗ = ВТ_СобственныеСИЗ.МВЗ
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ВыдачаСМВЗ.Комплект,
	|	ВТ_ВыдачаСМВЗ.Номенклатура,
	|	ВТ_ВыдачаСМВЗ.ХарактеристикаНоменклатуры,
	|	ВТ_ВыдачаСМВЗ.Цена,
	|	ВТ_ВыдачаСМВЗ.ДокументВыдачи,
	|	ВТ_ВыдачаСМВЗ.МВЗ,
	//АсТБ_Alexey_103067_********************************************************************
	|	ВТ_ВыдачаСМВЗ.НомерСтрокиКомплекта
	//АсТБ_Alexey_103067_********************************************************************
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПредварительныйПереходПраваСобственностиТовары.Номенклатура КАК Номенклатура,
	|	ПредварительныйПереходПраваСобственностиТовары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ПредварительныйПереходПраваСобственностиТовары.ДокументВыдачи КАК ДокументВыдачи,
	|	ПредварительныйПереходПраваСобственностиТовары.МВЗ КАК МВЗ,
	|	ПредварительныйПереходПраваСобственностиТовары.Количество КАК Количество,
	|	ПредварительныйПереходПраваСобственностиТовары.Сумма КАК Сумма
	|ПОМЕСТИТЬ ВТ_ВыдачиВПрошлыхПППС
	|ИЗ
	|	Документ.ПредварительныйПереходПраваСобственности.Товары КАК ПредварительныйПереходПраваСобственностиТовары
	|ГДЕ
	|	ПредварительныйПереходПраваСобственностиТовары.Ссылка.Проведен = ИСТИНА
	|	И НЕ ПредварительныйПереходПраваСобственностиТовары.Ссылка = &ЭтотДокумент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_РезультатДоСравнения.Комплект КАК Комплект,
	|	ВТ_РезультатДоСравнения.Номенклатура КАК Номенклатура,
	|	ВТ_РезультатДоСравнения.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	СУММА(ВТ_РезультатДоСравнения.Количество - ЕСТЬNULL(ВТ_ВыдачиВПрошлыхПППС.Количество, 0)) КАК Количество,
	|	ВТ_РезультатДоСравнения.Цена КАК Цена,
	|	СУММА(ВТ_РезультатДоСравнения.Цена * (ВТ_РезультатДоСравнения.Количество - ЕСТЬNULL(ВТ_ВыдачиВПрошлыхПППС.Количество, 0))) КАК Сумма,
	|	ВТ_РезультатДоСравнения.ДокументВыдачи КАК ДокументВыдачи,
	|	ВТ_РезультатДоСравнения.МВЗ КАК МВЗ,
	//АсТБ_Alexey_103067_********************************************************************
	|	ВТ_РезультатДоСравнения.НомерСтрокиКомплекта КАК НомерСтрокиКомплекта
	//АсТБ_Alexey_103067_********************************************************************
	|ПОМЕСТИТЬ ВТ_Результат
	|ИЗ
	|	ВТ_РезультатДоСравнения КАК ВТ_РезультатДоСравнения
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ВыдачиВПрошлыхПППС КАК ВТ_ВыдачиВПрошлыхПППС
	|		ПО ВТ_РезультатДоСравнения.Номенклатура = ВТ_ВыдачиВПрошлыхПППС.Номенклатура
	|			И ВТ_РезультатДоСравнения.ХарактеристикаНоменклатуры = ВТ_ВыдачиВПрошлыхПППС.ХарактеристикаНоменклатуры
	|			И ВТ_РезультатДоСравнения.ДокументВыдачи = ВТ_ВыдачиВПрошлыхПППС.ДокументВыдачи
	|			И ВТ_РезультатДоСравнения.МВЗ = ВТ_ВыдачиВПрошлыхПППС.МВЗ
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_РезультатДоСравнения.Комплект,
	|	ВТ_РезультатДоСравнения.Номенклатура,
	|	ВТ_РезультатДоСравнения.ХарактеристикаНоменклатуры,
	|	ВТ_РезультатДоСравнения.Цена,
	|	ВТ_РезультатДоСравнения.ДокументВыдачи,
	|	ВТ_РезультатДоСравнения.МВЗ,
	//АсТБ_Alexey_103067_********************************************************************
	|	ВТ_РезультатДоСравнения.НомерСтрокиКомплекта
	//АсТБ_Alexey_103067_********************************************************************
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Результат.Комплект КАК Комплект,
	|	ВТ_Результат.Номенклатура КАК Номенклатура,
	|	ВТ_Результат.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ВТ_Результат.Количество КАК Количество,
	|	ВТ_Результат.Цена КАК Цена,
	|	ВТ_Результат.Сумма КАК Сумма,
	|	ВТ_Результат.ДокументВыдачи КАК ДокументВыдачи,
	|	ВТ_Результат.МВЗ КАК МВЗ,
	//АсТБ_Alexey_103067_********************************************************************
	|	ВТ_Результат.НомерСтрокиКомплекта КАК НомерСтрокиКомплекта
	//АсТБ_Alexey_103067_********************************************************************
	|ИЗ
	|	ВТ_Результат КАК ВТ_Результат
	|ГДЕ
	|	ВТ_Результат.Количество > 0
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВТ_Результат.Комплект.Наименование,
	//АсТБ_Alexey_103067_********************************************************************
	|	ВТ_Результат.НомерСтрокиКомплекта,
	//АсТБ_Alexey_103067_********************************************************************
	|	ВТ_Результат.Номенклатура.Наименование,
	|	ВТ_Результат.ХарактеристикаНоменклатуры.КодSAP,
	|	ВТ_Результат.ДокументВыдачи.МоментВремени,
	|	Количество УБЫВ,
	|	ВТ_Результат.МВЗ.Наименование";
	
	//АсТБ_Alexey_56458_********************************************************************
	//информация по комплектам в запросе нужна для дальнейшего анализа и заполнения документа, согласно виду учета номенклатуры
	
	Запрос.УстановитьПараметр("ДатаНачала", 			НачалоДня(ТекущийОбъект.НачалоПериода));
	Запрос.УстановитьПараметр("ДатаОкончания", 			КонецДня(ТекущийОбъект.КонецПериода));
	Запрос.УстановитьПараметр("Организация", 			ТекущийОбъект.Организация);
	Запрос.УстановитьПараметр("ПериодРасчета", 			ПроцедурыРаботыСНормамиСервер.ПолучитьГраницуАнализаПоДокументу(ТекущийОбъект.Ссылка));
	Запрос.УстановитьПараметр("Период", 				?(ЗначениеЗаполнено(ТекущийОбъект.Ссылка),ТекущийОбъект.Дата,ТекущаяДата()));
	Если ТекущийОбъект.Организация.ИспользоватьПредварительныеЗаявкиНаКоллективнуюВыдачу Тогда
		Запрос.УстановитьПараметр("ВидОперацииВыдачиСИЗ", ?(ТекущийОбъект.Организация.ЗаполнениеППСприКоллективнойВыдаче = 0,Перечисления.ВидыОперацийВыдачиСИЗ.ПредварительнаяЗаявка,Перечисления.ВидыОперацийВыдачиСИЗ.ФактическаяВыдача));
	Иначе
		Запрос.УстановитьПараметр("ВидОперацииВыдачиСИЗ", Перечисления.ВидыОперацийВыдачиСИЗ.ФактическаяВыдача)
	КонецЕсли;
	Запрос.УстановитьПараметр("ЭтотДокумент", 			ТекущийОбъект.Ссылка);
	
	ТаблицаЗапроса = Запрос.Выполнить().Выгрузить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОстаткиНоменклатурыОбороты.Регистратор КАК Регистратор,
	|	ОстаткиНоменклатурыОбороты.Номенклатура КАК Номенклатура,
	|	ОстаткиНоменклатурыОбороты.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	СУММА(ОстаткиНоменклатурыОбороты.КоличествоПриход) КАК КоличествоПриход,
	|	ОстаткиНоменклатурыОбороты.Номенклатура.Наименование КАК НоменклатураНаименование,
	|	ОстаткиНоменклатурыОбороты.ХарактеристикаНоменклатуры.КодSAP КАК ХарактеристикаНоменклатурыКодSAP,
	|	ОстаткиНоменклатурыОбороты.Регистратор.МоментВремени КАК РегистраторМоментВремени
	|ИЗ
	|	РегистрНакопления.ОстаткиНоменклатуры.Обороты(, , Регистратор, ) КАК ОстаткиНоменклатурыОбороты
	|ГДЕ
	|	ОстаткиНоменклатурыОбороты.Регистратор.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийВыдачиСИЗ.ПредварительнаяЗаявка)
	|	И ОстаткиНоменклатурыОбороты.Регистратор В(&МассивРегистраторов)
	|
	|СГРУППИРОВАТЬ ПО
	|	ОстаткиНоменклатурыОбороты.Регистратор,
	|	ОстаткиНоменклатурыОбороты.Номенклатура,
	|	ОстаткиНоменклатурыОбороты.ХарактеристикаНоменклатуры,
	|	ОстаткиНоменклатурыОбороты.Номенклатура.Наименование,
	|	ОстаткиНоменклатурыОбороты.ХарактеристикаНоменклатуры.КодSAP,
	|	ОстаткиНоменклатурыОбороты.Регистратор.МоментВремени
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОстаткиНоменклатурыОбороты.Регистратор,
	|	ОстаткиНоменклатурыОбороты.Номенклатура,
	|	ОстаткиНоменклатурыОбороты.ХарактеристикаНоменклатуры,
	|	СУММА(ОстаткиНоменклатурыОбороты.КоличествоРасход),
	|	ОстаткиНоменклатурыОбороты.Номенклатура.Наименование,
	|	ОстаткиНоменклатурыОбороты.ХарактеристикаНоменклатуры.КодSAP,
	|	ОстаткиНоменклатурыОбороты.Регистратор.МоментВремени
	|ИЗ
	|	РегистрНакопления.ОстаткиНоменклатуры.Обороты(, , Регистратор, ) КАК ОстаткиНоменклатурыОбороты
	|ГДЕ
	|	ОстаткиНоменклатурыОбороты.Регистратор В(&МассивРегистраторов)
	|	И ОстаткиНоменклатурыОбороты.Склад.АвтоматизированнаяВыдача = ИСТИНА
	|
	|СГРУППИРОВАТЬ ПО
	|	ОстаткиНоменклатурыОбороты.Регистратор,
	|	ОстаткиНоменклатурыОбороты.Номенклатура,
	|	ОстаткиНоменклатурыОбороты.ХарактеристикаНоменклатуры,
	|	ОстаткиНоменклатурыОбороты.Номенклатура.Наименование,
	|	ОстаткиНоменклатурыОбороты.ХарактеристикаНоменклатуры.КодSAP,
	|	ОстаткиНоменклатурыОбороты.Регистратор.МоментВремени
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОстаткиНоменклатурыОбороты.Регистратор,
	|	ОстаткиНоменклатурыОбороты.Номенклатура,
	|	ОстаткиНоменклатурыОбороты.ХарактеристикаНоменклатуры,
	|	СУММА(ОстаткиНоменклатурыОбороты.КоличествоРасход),
	|	ОстаткиНоменклатурыОбороты.Номенклатура.Наименование,
	|	ОстаткиНоменклатурыОбороты.ХарактеристикаНоменклатуры.КодSAP,
	|	ОстаткиНоменклатурыОбороты.Регистратор.МоментВремени
	|ИЗ
	|	РегистрНакопления.ОстаткиНоменклатуры.Обороты(, , Регистратор, ) КАК ОстаткиНоменклатурыОбороты
	|ГДЕ
	|	ОстаткиНоменклатурыОбороты.Регистратор В(&МассивРегистраторов)
	|	И ВЫБОР
	|			КОГДА &ВидОперацииВыдачиСИЗ = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийВыдачиСИЗ.ФактическаяВыдача)
	|				ТОГДА ОстаткиНоменклатурыОбороты.Регистратор.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийВыдачиСИЗ.ФактическаяВыдача)
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ
	|	И НЕ ОстаткиНоменклатурыОбороты.Склад.АвтоматизированнаяВыдача = ИСТИНА
	|
	|СГРУППИРОВАТЬ ПО
	|	ОстаткиНоменклатурыОбороты.Регистратор,
	|	ОстаткиНоменклатурыОбороты.Номенклатура,
	|	ОстаткиНоменклатурыОбороты.ХарактеристикаНоменклатуры,
	|	ОстаткиНоменклатурыОбороты.Номенклатура.Наименование,
	|	ОстаткиНоменклатурыОбороты.ХарактеристикаНоменклатуры.КодSAP,
	|	ОстаткиНоменклатурыОбороты.Регистратор.МоментВремени
	|
	|УПОРЯДОЧИТЬ ПО
	|	НоменклатураНаименование,
	|	ХарактеристикаНоменклатурыКодSAP,
	|	РегистраторМоментВремени";
	
	Запрос.УстановитьПараметр("МассивРегистраторов",ТаблицаЗапроса.ВыгрузитьКолонку("ДокументВыдачи"));
	Если ТекущийОбъект.Организация.ИспользоватьПредварительныеЗаявкиНаКоллективнуюВыдачу Тогда
		Запрос.УстановитьПараметр("ВидОперацииВыдачиСИЗ", ?(ТекущийОбъект.Организация.ЗаполнениеППСприКоллективнойВыдаче = 0,Перечисления.ВидыОперацийВыдачиСИЗ.ПредварительнаяЗаявка,Перечисления.ВидыОперацийВыдачиСИЗ.ФактическаяВыдача));
	Иначе
		Запрос.УстановитьПараметр("ВидОперацииВыдачиСИЗ", Перечисления.ВидыОперацийВыдачиСИЗ.ФактическаяВыдача)
	КонецЕсли;
	
	ТаблицаПоступленийПоОстаткам = Запрос.Выполнить().Выгрузить();
	
	ТекущийОбъект.Товары.Очистить();
	
	//АсТБ_Alexey_56458_********************************************************************
	// в таблице документа нет колонки "Комплект", поэтому делаю промежуточную таблицу
	ТаблицаДокумента = ТекущийОбъект.Товары.Выгрузить();
	ТаблицаДокумента.Колонки.Добавить("Комплект", НОВЫЙ ОписаниеТипов("СправочникСсылка.Номенклатура"));
	//АсТБ_Alexey_56458_********************************************************************
	
	//АсТБ_Alexey_103067_********************************************************************
	ТаблицаДокумента.Колонки.Добавить("НомерСтрокиКомплекта", НОВЫЙ ОписаниеТипов("Число"));
	//АсТБ_Alexey_103067_********************************************************************
	
	Для КАждого СтрокаТаблицыЗапроса Из ТаблицаЗапроса Цикл
		
		СтруктураПоиска = Новый Структура;
		СтруктураПоиска.Вставить("Регистратор",					СтрокаТаблицыЗапроса.ДокументВыдачи);
		СтруктураПоиска.Вставить("Номенклатура",				СтрокаТаблицыЗапроса.Номенклатура);
		СтруктураПоиска.Вставить("ХарактеристикаНоменклатуры",	СтрокаТаблицыЗапроса.ХарактеристикаНоменклатуры);
		
		НайденныеСтроки = ТаблицаПоступленийПоОстаткам.НайтиСтроки(СтруктураПоиска);
		
		Если НайденныеСтроки.Количество() = 0 Тогда
			
			Если ТипЗнч(СтрокаТаблицыЗапроса.ДокументВыдачи) = Тип("ДокументСсылка.ВыдачаСредствЗащитыСотруднику") Тогда
				Если СтрокаТаблицыЗапроса.ДокументВыдачи.ВидВыдачиСИЗ = Перечисления.ВидыВыдачиСИЗ.КоллективнаяВыдача Тогда
					Если НЕ ТекущийОбъект.Организация.ИспользоватьПредварительныеЗаявкиНаКоллективнуюВыдачу Тогда
						//АсТБ_Alexey_56458_********************************************************************
						//ЗаполнитьЗначенияСвойств(ТекущийОбъект.Товары.Добавить(),СтрокаТаблицыЗапроса);
						ЗаполнитьЗначенияСвойств(ТаблицаДокумента.Добавить(),СтрокаТаблицыЗапроса);
						//АсТБ_Alexey_56458_********************************************************************
					КонецЕсли;
				Иначе
					//АсТБ_Alexey_56458_********************************************************************
					//ЗаполнитьЗначенияСвойств(ТекущийОбъект.Товары.Добавить(),СтрокаТаблицыЗапроса);
					ЗаполнитьЗначенияСвойств(ТаблицаДокумента.Добавить(),СтрокаТаблицыЗапроса);
					//АсТБ_Alexey_56458_********************************************************************
				КонецЕсли;
			Иначе
				//АсТБ_Alexey_56458_********************************************************************
				//ЗаполнитьЗначенияСвойств(ТекущийОбъект.Товары.Добавить(),СтрокаТаблицыЗапроса);
				ЗаполнитьЗначенияСвойств(ТаблицаДокумента.Добавить(),СтрокаТаблицыЗапроса);
				//АсТБ_Alexey_56458_********************************************************************
			КонецЕсли;
			
		Иначе	
			
			Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
				
				Если НайденнаяСтрока.КоличествоПриход = 0 Тогда
					Прервать;
				Иначе
					Если СтрокаТаблицыЗапроса.Количество >= НайденнаяСтрока.КоличествоПриход Тогда
						//АсТБ_Alexey_56458_********************************************************************
						//НоваяСтрока = ТекущийОбъект.Товары.Добавить();
						НоваяСтрока = ТаблицаДокумента.Добавить();
						//АсТБ_Alexey_56458_********************************************************************
						ЗаполнитьЗначенияСвойств(НоваяСтрока,СтрокаТаблицыЗапроса);
						НоваяСтрока.Количество 				= НайденнаяСтрока.КоличествоПриход;
						НоваяСтрока.Сумма 					= СтрокаТаблицыЗапроса.Цена * НайденнаяСтрока.КоличествоПриход;
						НайденнаяСтрока.КоличествоПриход 	= 0;
					Иначе
						//АсТБ_Alexey_56458_********************************************************************
						//ЗаполнитьЗначенияСвойств(ТекущийОбъект.Товары.Добавить(),СтрокаТаблицыЗапроса);
						ЗаполнитьЗначенияСвойств(ТаблицаДокумента.Добавить(),СтрокаТаблицыЗапроса);
						//АсТБ_Alexey_56458_********************************************************************
						НайденнаяСтрока.КоличествоПриход 	= НайденнаяСтрока.КоличествоПриход - СтрокаТаблицыЗапроса.Количество;
					КонецЕсли;	
				КонецЕсли;	
				
			КонецЦикла;	
			
		КонецЕсли;	
		
	КонецЦикла;	
	
	//АсТБ_Alexey_56458_********************************************************************
	//обработка комплектов по виду учета номенклатуры
	РезультрующаяТаблица = ПроцедурыРаботыСНормамиСервер.ОбработатьКомплектыДляППС(ТаблицаДокумента,ТекущийОбъект);
	ТекущийОбъект.Товары.Загрузить(РезультрующаяТаблица);
	//АсТБ_Alexey_56458_********************************************************************
	
	ТекущийОбъект.СуммаДокумента = ТекущийОбъект.Товары.Итог("Сумма");

КонецПроцедуры

#КонецЕсли
